.. _nit_userguide:

NIT Strings
============

Introduction
------------

The function :func:`clean_co_nit() <dataprep.clean.clean_co_nit.clean_co_nit>` cleans a column containing Colombian identity code (NIT) strings, and standardizes them in a given format. The function :func:`validate_co_nit() <dataprep.clean.clean_co_nit.validate_co_nit>` validates either a single NIT strings, a column of NIT strings or a DataFrame of NIT strings, returning `True` if the value is valid, and `False` otherwise.

NIT strings can be converted to the following formats via the `output_format` parameter:

* `compact`: only number strings without any seperators or whitespace, like "2131234321"
* `standard`: NIT strings with proper whitespace in the proper places, like "213.123.432-1"

Invalid parsing is handled with the `errors` parameter:

* `coerce` (default): invalid parsing will be set to NaN
* `ignore`: invalid parsing will return the input
* `raise`: invalid parsing will raise an exception

The following sections demonstrate the functionality of `clean_co_nit()` and `validate_co_nit()`.

### An example dataset containing NIT strings

In [1]:
import pandas as pd
import numpy as np
df = pd.DataFrame(
    {
        "nit": [
            "2131234321",
            "2131234325",
            "51824753556",
            "51 824 753 556",
            "hello",
            np.nan,
            "NULL"
        ], 
        "address": [
            "123 Pine Ave.",
            "main st",
            "1234 west main heights 57033",
            "apt 1 789 s maple rd manhattan",
            "robie house, 789 north main street",
            "(staples center) 1111 S Figueroa St, Los Angeles",
            "hello",
        ]
    }
)
df

              nit                                           address
0      2131234321                                     123 Pine Ave.
1      2131234325                                           main st
2     51824753556                      1234 west main heights 57033
3  51 824 753 556                    apt 1 789 s maple rd manhattan
4           hello                robie house, 789 north main street
5             NaN  (staples center) 1111 S Figueroa St, Los Angeles
6            NULL                                             hello

## 1. Default `clean_co_nit`

By default, `clean_co_nit` will clean nit strings and output them in the standard format with proper separators.

In [2]:
from dataprep.clean import clean_co_nit
clean_co_nit(df, column = "nit")

,nit,address,nit_clean
0,2131234321,123 Pine Ave.,213.123.432-1
1,2131234325,main st,NaN
2,51824753556,1234 west main heights 57033,NaN
3,51 824 753 556,apt 1 789 s maple rd manhattan,NaN
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

## 2. Output formats

This section demonstrates the output parameter.

### `standard` (default)

In [3]:
clean_co_nit(df, column = "nit", output_format="standard")

,nit,address,nit_clean
0,2131234321,123 Pine Ave.,213.123.432-1
1,2131234325,main st,NaN
2,51824753556,1234 west main heights 57033,NaN
3,51 824 753 556,apt 1 789 s maple rd manhattan,NaN
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

### `compact`

In [4]:
clean_co_nit(df, column = "nit", output_format="compact")

,nit,address,nit_clean
0,2131234321,123 Pine Ave.,2131234321
1,2131234325,main st,NaN
2,51824753556,1234 west main heights 57033,NaN
3,51 824 753 556,apt 1 789 s maple rd manhattan,NaN
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

## 3. `inplace` parameter

This deletes the given column from the returned DataFrame. 
A new column containing cleaned NIT strings is added with a title in the format `"{original title}_clean"`.

In [5]:
clean_co_nit(df, column="nit", inplace=True)

       nit_clean                                           address
0  213.123.432-1                                     123 Pine Ave.
1            NaN                                           main st
2            NaN                      1234 west main heights 57033
3            NaN                    apt 1 789 s maple rd manhattan
4            NaN                robie house, 789 north main street
5            NaN  (staples center) 1111 S Figueroa St, Los Angeles
6            NaN                                             hello

## 4. `errors` parameter

### `coerce` (default)

In [6]:
clean_co_nit(df, "nit", errors="coerce")

,nit,address,nit_clean
0,2131234321,123 Pine Ave.,213.123.432-1
1,2131234325,main st,NaN
2,51824753556,1234 west main heights 57033,NaN
3,51 824 753 556,apt 1 789 s maple rd manhattan,NaN
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

### `ignore`

In [7]:
clean_co_nit(df, "nit", errors="ignore")

,nit,address,nit_clean
0,2131234321,123 Pine Ave.,213.123.432-1
1,2131234325,main st,2131234325
2,51824753556,1234 west main heights 57033,51824753556
3,51 824 753 556,apt 1 789 s maple rd manhattan,51 824 753 556
4,hello,"robie house, 789 north main street",hello
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

## 4. `validate_co_nit()`

`validate_co_nit()` returns `True` when the input is a valid NIT. Otherwise it returns `False`.

The input of `validate_co_nit()` can be a string, a Pandas DataSeries, a Dask DataSeries, a Pandas DataFrame and a dask DataFrame.

When the input is a string, a Pandas DataSeries or a Dask DataSeries, user doesn't need to specify a column name to be validated. 

When the input is a Pandas DataFrame or a dask DataFrame, user can both specify or not specify a column name to be validated. If user specify the column name, `validate_co_nit()` only returns the validation result for the specified column. If user doesn't specify the column name, `validate_co_nit()` returns the validation result for the whole DataFrame.

In [8]:
from dataprep.clean import validate_co_nit
print(validate_co_nit("2131234321"))
print(validate_co_nit("2131234325"))
print(validate_co_nit("51824753556"))
print(validate_co_nit("51 824 753 556"))
print(validate_co_nit("hello"))
print(validate_co_nit(np.nan))
print(validate_co_nit("NULL"))

True
False
False
False
False
False
False

### Series

In [9]:
validate_co_nit(df["nit"])

0     True
1    False
2    False
3    False
4    False
5    False
6    False
Name: nit, dtype: bool

### DataFrame + Specify Column

In [10]:
validate_co_nit(df, column="nit")

0     True
1    False
2    False
3    False
4    False
5    False
6    False
Name: nit, dtype: bool

### Only DataFrame

In [11]:
validate_co_nit(df)

     nit  address
0   True    False
1  False    False
2  False    False
3  False    False
4  False    False
5  False    False
6  False    False